espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/rmt_reg.h
/** RMT_CH4CONF0_REG register
 *  Channel 4 configure register 0
 */
#define RMT_CH4CONF0_REG (DR_REG_RMT_BASE + 0x30)
/** RMT_DIV_CNT_CH4 : R/W; bitpos: [7:0]; default: 2;
 *  This register is used to configure the divider for clock of CHANNEL4.
 */
#define RMT_DIV_CNT_CH4    0x000000FFU
#define RMT_DIV_CNT_CH4_M  (RMT_DIV_CNT_CH4_V << RMT_DIV_CNT_CH4_S)
#define RMT_DIV_CNT_CH4_V  0x000000FFU
#define RMT_DIV_CNT_CH4_S  0
/** RMT_IDLE_THRES_CH4 : R/W; bitpos: [22:8]; default: 32767;
 *  When no edge is detected on the input signal and continuous clock cycles is longer
 *  than this register value, received process is finished.
 */
#define RMT_IDLE_THRES_CH4    0x00007FFFU
#define RMT_IDLE_THRES_CH4_M  (RMT_IDLE_THRES_CH4_V << RMT_IDLE_THRES_CH4_S)
#define RMT_IDLE_THRES_CH4_V  0x00007FFFU
#define RMT_IDLE_THRES_CH4_S  8
/** RMT_MEM_SIZE_CH4 : R/W; bitpos: [27:24]; default: 1;
 *  This register is used to configure the maximum size of memory allocated to CHANNEL4.
 */
#define RMT_MEM_SIZE_CH4    0x0000000FU
#define RMT_MEM_SIZE_CH4_M  (RMT_MEM_SIZE_CH4_V << RMT_MEM_SIZE_CH4_S)
#define RMT_MEM_SIZE_CH4_V  0x0000000FU
#define RMT_MEM_SIZE_CH4_S  24
/** RMT_CARRIER_EN_CH4 : R/W; bitpos: [28]; default: 1;
 *  This is the carrier modulation enable-control bit for CHANNEL4. 1: Add carrier
 *  modulation in the output signal. 0: No carrier modulation in sig_out.
 */
#define RMT_CARRIER_EN_CH4    (BIT(28))
#define RMT_CARRIER_EN_CH4_M  (RMT_CARRIER_EN_CH4_V << RMT_CARRIER_EN_CH4_S)
#define RMT_CARRIER_EN_CH4_V  0x00000001U
#define RMT_CARRIER_EN_CH4_S  28
/** RMT_CARRIER_OUT_LV_CH4 : R/W; bitpos: [29]; default: 1;
 *  This bit is used to configure the position of carrier wave for CHANNEL4.1'h0: add
 *  carrier wave on low level.1'h1: add carrier wave on high level.
 */
#define RMT_CARRIER_OUT_LV_CH4    (BIT(29))
#define RMT_CARRIER_OUT_LV_CH4_M  (RMT_CARRIER_OUT_LV_CH4_V << RMT_CARRIER_OUT_LV_CH4_S)
#define RMT_CARRIER_OUT_LV_CH4_V  0x00000001U
#define RMT_CARRIER_OUT_LV_CH4_S  29

/** RMT_CH4CONF1_REG register
 *  Channel 4 configure register 1
 */
#define RMT_CH4CONF1_REG (DR_REG_RMT_BASE + 0x34)
/** RMT_RX_EN_CH4 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable receiver to receive data on CHANNEL4.
 */
#define RMT_RX_EN_CH4    (BIT(0))
#define RMT_RX_EN_CH4_M  (RMT_RX_EN_CH4_V << RMT_RX_EN_CH4_S)
#define RMT_RX_EN_CH4_V  0x00000001U
#define RMT_RX_EN_CH4_S  0
/** RMT_MEM_WR_RST_CH4 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset write ram address for CHANNEL4 by accessing receiver.
 */
#define RMT_MEM_WR_RST_CH4    (BIT(1))
#define RMT_MEM_WR_RST_CH4_M  (RMT_MEM_WR_RST_CH4_V << RMT_MEM_WR_RST_CH4_S)
#define RMT_MEM_WR_RST_CH4_V  0x00000001U
#define RMT_MEM_WR_RST_CH4_S  1
/** RMT_APB_MEM_RST_CH4 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL4 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_CH4    (BIT(2))
#define RMT_APB_MEM_RST_CH4_M  (RMT_APB_MEM_RST_CH4_V << RMT_APB_MEM_RST_CH4_S)
#define RMT_APB_MEM_RST_CH4_V  0x00000001U
#define RMT_APB_MEM_RST_CH4_S  2
/** RMT_MEM_OWNER_CH4 : R/W/SC; bitpos: [3]; default: 1;
 *  This register marks the ownership of CHANNEL4's ram block.1'h1: Receiver is using
 *  the ram. 1'h0: APB bus is using the ram.
 */
#define RMT_MEM_OWNER_CH4    (BIT(3))
#define RMT_MEM_OWNER_CH4_M  (RMT_MEM_OWNER_CH4_V << RMT_MEM_OWNER_CH4_S)
#define RMT_MEM_OWNER_CH4_V  0x00000001U
#define RMT_MEM_OWNER_CH4_S  3
/** RMT_RX_FILTER_EN_CH4 : R/W; bitpos: [4]; default: 0;
 *  This is the receive filter's enable bit for CHANNEL4.
 */
#define RMT_RX_FILTER_EN_CH4    (BIT(4))
#define RMT_RX_FILTER_EN_CH4_M  (RMT_RX_FILTER_EN_CH4_V << RMT_RX_FILTER_EN_CH4_S)
#define RMT_RX_FILTER_EN_CH4_V  0x00000001U
#define RMT_RX_FILTER_EN_CH4_S  4
/** RMT_RX_FILTER_THRES_CH4 : R/W; bitpos: [12:5]; default: 15;
 *  Ignores the input pulse when its width is smaller than this register value in APB
 *  clock periods (in receive mode).
 */
#define RMT_RX_FILTER_THRES_CH4    0x000000FFU
#define RMT_RX_FILTER_THRES_CH4_M  (RMT_RX_FILTER_THRES_CH4_V << RMT_RX_FILTER_THRES_CH4_S)
#define RMT_RX_FILTER_THRES_CH4_V  0x000000FFU
#define RMT_RX_FILTER_THRES_CH4_S  5
/** RMT_MEM_RX_WRAP_EN_CH4 : R/W; bitpos: [13]; default: 0;
 *  This is the channel 4 enable bit for wraparound mode: it will resume receiving at
 *  the start when the data to be received is more than its memory size.
 */
#define RMT_MEM_RX_WRAP_EN_CH4    (BIT(13))
#define RMT_MEM_RX_WRAP_EN_CH4_M  (RMT_MEM_RX_WRAP_EN_CH4_V << RMT_MEM_RX_WRAP_EN_CH4_S)
#define RMT_MEM_RX_WRAP_EN_CH4_V  0x00000001U
#define RMT_MEM_RX_WRAP_EN_CH4_S  13
/** RMT_CONF_UPDATE_CH4 : WT; bitpos: [15]; default: 0;
 *  synchronization bit for CHANNEL4
 */
#define RMT_CONF_UPDATE_CH4    (BIT(15))
#define RMT_CONF_UPDATE_CH4_M  (RMT_CONF_UPDATE_CH4_V << RMT_CONF_UPDATE_CH4_S)
#define RMT_CONF_UPDATE_CH4_V  0x00000001U
#define RMT_CONF_UPDATE_CH4_S  15

/** RMT_CH5CONF0_REG register
 *  Channel 5 configure register 0
 */
#define RMT_CH5CONF0_REG (DR_REG_RMT_BASE + 0x38)
/** RMT_DIV_CNT_CH5 : R/W; bitpos: [7:0]; default: 2;
 *  This register is used to configure the divider for clock of CHANNEL5.
 */
#define RMT_DIV_CNT_CH5    0x000000FFU
#define RMT_DIV_CNT_CH5_M  (RMT_DIV_CNT_CH5_V << RMT_DIV_CNT_CH5_S)
#define RMT_DIV_CNT_CH5_V  0x000000FFU
#define RMT_DIV_CNT_CH5_S  0
/** RMT_IDLE_THRES_CH5 : R/W; bitpos: [22:8]; default: 32767;
 *  When no edge is detected on the input signal and continuous clock cycles is longer
 *  than this register value, received process is finished.
 */
#define RMT_IDLE_THRES_CH5    0x00007FFFU
#define RMT_IDLE_THRES_CH5_M  (RMT_IDLE_THRES_CH5_V << RMT_IDLE_THRES_CH5_S)
#define RMT_IDLE_THRES_CH5_V  0x00007FFFU
#define RMT_IDLE_THRES_CH5_S  8
/** RMT_MEM_SIZE_CH5 : R/W; bitpos: [27:24]; default: 1;
 *  This register is used to configure the maximum size of memory allocated to CHANNEL5.
 */
#define RMT_MEM_SIZE_CH5    0x0000000FU
#define RMT_MEM_SIZE_CH5_M  (RMT_MEM_SIZE_CH5_V << RMT_MEM_SIZE_CH5_S)
#define RMT_MEM_SIZE_CH5_V  0x0000000FU
#define RMT_MEM_SIZE_CH5_S  24
/** RMT_CARRIER_EN_CH5 : R/W; bitpos: [28]; default: 1;
 *  This is the carrier modulation enable-control bit for CHANNEL5. 1: Add carrier
 *  modulation in the output signal. 0: No carrier modulation in sig_out.
 */
#define RMT_CARRIER_EN_CH5    (BIT(28))
#define RMT_CARRIER_EN_CH5_M  (RMT_CARRIER_EN_CH5_V << RMT_CARRIER_EN_CH5_S)
#define RMT_CARRIER_EN_CH5_V  0x00000001U
#define RMT_CARRIER_EN_CH5_S  28
/** RMT_CARRIER_OUT_LV_CH5 : R/W; bitpos: [29]; default: 1;
 *  This bit is used to configure the position of carrier wave for CHANNEL5.1'h0: add
 *  carrier wave on low level.1'h1: add carrier wave on high level.
 */
#define RMT_CARRIER_OUT_LV_CH5    (BIT(29))
#define RMT_CARRIER_OUT_LV_CH5_M  (RMT_CARRIER_OUT_LV_CH5_V << RMT_CARRIER_OUT_LV_CH5_S)
#define RMT_CARRIER_OUT_LV_CH5_V  0x00000001U
#define RMT_CARRIER_OUT_LV_CH5_S  29

/** RMT_CH5CONF1_REG register
 *  Channel 5 configure register 1
 */
#define RMT_CH5CONF1_REG (DR_REG_RMT_BASE + 0x3c)
/** RMT_RX_EN_CH5 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable receiver to receive data on CHANNEL5.
 */
#define RMT_RX_EN_CH5    (BIT(0))
#define RMT_RX_EN_CH5_M  (RMT_RX_EN_CH5_V << RMT_RX_EN_CH5_S)
#define RMT_RX_EN_CH5_V  0x00000001U
#define RMT_RX_EN_CH5_S  0
/** RMT_MEM_WR_RST_CH5 : WT; bitpos: [1]; default: 0;
 *  Set this bit to reset write ram address for CHANNEL5 by accessing receiver.
 */
#define RMT_MEM_WR_RST_CH5    (BIT(1))
#define RMT_MEM_WR_RST_CH5_M  (RMT_MEM_WR_RST_CH5_V << RMT_MEM_WR_RST_CH5_S)
#define RMT_MEM_WR_RST_CH5_V  0x00000001U
#define RMT_MEM_WR_RST_CH5_S  1
/** RMT_APB_MEM_RST_CH5 : WT; bitpos: [2]; default: 0;
 *  Set this bit to reset W/R ram address for CHANNEL5 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_CH5    (BIT(2))
#define RMT_APB_MEM_RST_CH5_M  (RMT_APB_MEM_RST_CH5_V << RMT_APB_MEM_RST_CH5_S)
#define RMT_APB_MEM_RST_CH5_V  0x00000001U
#define RMT_APB_MEM_RST_CH5_S  2
/** RMT_MEM_OWNER_CH5 : R/W/SC; bitpos: [3]; default: 1;
 *  This register marks the ownership of CHANNEL5's ram block.1'h1: Receiver is using
 *  the ram. 1'h0: APB bus is using the ram.
 */
#define RMT_MEM_OWNER_CH5    (BIT(3))
#define RMT_MEM_OWNER_CH5_M  (RMT_MEM_OWNER_CH5_V << RMT_MEM_OWNER_CH5_S)
#define RMT_MEM_OWNER_CH5_V  0x00000001U
#define RMT_MEM_OWNER_CH5_S  3
/** RMT_RX_FILTER_EN_CH5 : R/W; bitpos: [4]; default: 0;
 *  This is the receive filter's enable bit for CHANNEL5.
 */
#define RMT_RX_FILTER_EN_CH5    (BIT(4))
#define RMT_RX_FILTER_EN_CH5_M  (RMT_RX_FILTER_EN_CH5_V << RMT_RX_FILTER_EN_CH5_S)
#define RMT_RX_FILTER_EN_CH5_V  0x00000001U
#define RMT_RX_FILTER_EN_CH5_S  4
/** RMT_RX_FILTER_THRES_CH5 : R/W; bitpos: [12:5]; default: 15;
 *  Ignores the input pulse when its width is smaller than this register value in APB
 *  clock periods (in receive mode).
 */
#define RMT_RX_FILTER_THRES_CH5    0x000000FFU
#define RMT_RX_FILTER_THRES_CH5_M  (RMT_RX_FILTER_THRES_CH5_V << RMT_RX_FILTER_THRES_CH5_S)
#define RMT_RX_FILTER_THRES_CH5_V  0x000000FFU
#define RMT_RX_FILTER_THRES_CH5_S  5
/** RMT_MEM_RX_WRAP_EN_CH5 : R/W; bitpos: [13]; default: 0;
 *  This is the channel 5 enable bit for wraparound mode: it will resume receiving at
 *  the start when the data to be received is more than its memory size.
 */
#define RMT_MEM_RX_WRAP_EN_CH5    (BIT(13))
#define RMT_MEM_RX_WRAP_EN_CH5_M  (RMT_MEM_RX_WRAP_EN_CH5_V << RMT_MEM_RX_WRAP_EN_CH5_S)
#define RMT_MEM_RX_WRAP_EN_CH5_V  0x00000001U
#define RMT_MEM_RX_WRAP_EN_CH5_S  13
/** RMT_CONF_UPDATE_CH5 : WT; bitpos: [15]; default: 0;
 *  synchronization bit for CHANNEL5
 */
#define RMT_CONF_UPDATE_CH5    (BIT(15))
#define RMT_CONF_UPDATE_CH5_M  (RMT_CONF_UPDATE_CH5_V << RMT_CONF_UPDATE_CH5_S)
#define RMT_CONF_UPDATE_CH5_V  0x00000001U
#define RMT_CONF_UPDATE_CH5_S  15

