espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/rmt_reg.h
/** RMT_CH0STATUS_REG register
 *  Channel 0 status register
 */
#define RMT_CH0STATUS_REG (DR_REG_RMT_BASE + 0x50)
/** RMT_MEM_RADDR_EX_CH0 : RO; bitpos: [9:0]; default: 0;
 *  This register records the memory address offset when transmitter of CHANNEL0 is
 *  using the RAM.
 */
#define RMT_MEM_RADDR_EX_CH0    0x000003FFU
#define RMT_MEM_RADDR_EX_CH0_M  (RMT_MEM_RADDR_EX_CH0_V << RMT_MEM_RADDR_EX_CH0_S)
#define RMT_MEM_RADDR_EX_CH0_V  0x000003FFU
#define RMT_MEM_RADDR_EX_CH0_S  0
/** RMT_APB_MEM_WADDR_CH0 : RO; bitpos: [20:11]; default: 0;
 *  This register records the memory address offset when writes RAM over APB bus.
 */
#define RMT_APB_MEM_WADDR_CH0    0x000003FFU
#define RMT_APB_MEM_WADDR_CH0_M  (RMT_APB_MEM_WADDR_CH0_V << RMT_APB_MEM_WADDR_CH0_S)
#define RMT_APB_MEM_WADDR_CH0_V  0x000003FFU
#define RMT_APB_MEM_WADDR_CH0_S  11
/** RMT_STATE_CH0 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL0.
 */
#define RMT_STATE_CH0    0x00000007U
#define RMT_STATE_CH0_M  (RMT_STATE_CH0_V << RMT_STATE_CH0_S)
#define RMT_STATE_CH0_V  0x00000007U
#define RMT_STATE_CH0_S  22
/** RMT_MEM_EMPTY_CH0 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the data to be set is more than memory size and
 *  the wraparound mode is disabled.
 */
#define RMT_MEM_EMPTY_CH0    (BIT(25))
#define RMT_MEM_EMPTY_CH0_M  (RMT_MEM_EMPTY_CH0_V << RMT_MEM_EMPTY_CH0_S)
#define RMT_MEM_EMPTY_CH0_V  0x00000001U
#define RMT_MEM_EMPTY_CH0_S  25
/** RMT_APB_MEM_WR_ERR_CH0 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the offset address out of memory size when writes
 *  via APB bus.
 */
#define RMT_APB_MEM_WR_ERR_CH0    (BIT(26))
#define RMT_APB_MEM_WR_ERR_CH0_M  (RMT_APB_MEM_WR_ERR_CH0_V << RMT_APB_MEM_WR_ERR_CH0_S)
#define RMT_APB_MEM_WR_ERR_CH0_V  0x00000001U
#define RMT_APB_MEM_WR_ERR_CH0_S  26

/** RMT_CH1STATUS_REG register
 *  Channel 1 status register
 */
#define RMT_CH1STATUS_REG (DR_REG_RMT_BASE + 0x54)
/** RMT_MEM_RADDR_EX_CH1 : RO; bitpos: [9:0]; default: 0;
 *  This register records the memory address offset when transmitter of CHANNEL1 is
 *  using the RAM.
 */
#define RMT_MEM_RADDR_EX_CH1    0x000003FFU
#define RMT_MEM_RADDR_EX_CH1_M  (RMT_MEM_RADDR_EX_CH1_V << RMT_MEM_RADDR_EX_CH1_S)
#define RMT_MEM_RADDR_EX_CH1_V  0x000003FFU
#define RMT_MEM_RADDR_EX_CH1_S  0
/** RMT_APB_MEM_WADDR_CH1 : RO; bitpos: [20:11]; default: 0;
 *  This register records the memory address offset when writes RAM over APB bus.
 */
#define RMT_APB_MEM_WADDR_CH1    0x000003FFU
#define RMT_APB_MEM_WADDR_CH1_M  (RMT_APB_MEM_WADDR_CH1_V << RMT_APB_MEM_WADDR_CH1_S)
#define RMT_APB_MEM_WADDR_CH1_V  0x000003FFU
#define RMT_APB_MEM_WADDR_CH1_S  11
/** RMT_STATE_CH1 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL1.
 */
#define RMT_STATE_CH1    0x00000007U
#define RMT_STATE_CH1_M  (RMT_STATE_CH1_V << RMT_STATE_CH1_S)
#define RMT_STATE_CH1_V  0x00000007U
#define RMT_STATE_CH1_S  22
/** RMT_MEM_EMPTY_CH1 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the data to be set is more than memory size and
 *  the wraparound mode is disabled.
 */
#define RMT_MEM_EMPTY_CH1    (BIT(25))
#define RMT_MEM_EMPTY_CH1_M  (RMT_MEM_EMPTY_CH1_V << RMT_MEM_EMPTY_CH1_S)
#define RMT_MEM_EMPTY_CH1_V  0x00000001U
#define RMT_MEM_EMPTY_CH1_S  25
/** RMT_APB_MEM_WR_ERR_CH1 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the offset address out of memory size when writes
 *  via APB bus.
 */
#define RMT_APB_MEM_WR_ERR_CH1    (BIT(26))
#define RMT_APB_MEM_WR_ERR_CH1_M  (RMT_APB_MEM_WR_ERR_CH1_V << RMT_APB_MEM_WR_ERR_CH1_S)
#define RMT_APB_MEM_WR_ERR_CH1_V  0x00000001U
#define RMT_APB_MEM_WR_ERR_CH1_S  26

/** RMT_CH2STATUS_REG register
 *  Channel 2 status register
 */
#define RMT_CH2STATUS_REG (DR_REG_RMT_BASE + 0x58)
/** RMT_MEM_RADDR_EX_CH2 : RO; bitpos: [9:0]; default: 0;
 *  This register records the memory address offset when transmitter of CHANNEL2 is
 *  using the RAM.
 */
#define RMT_MEM_RADDR_EX_CH2    0x000003FFU
#define RMT_MEM_RADDR_EX_CH2_M  (RMT_MEM_RADDR_EX_CH2_V << RMT_MEM_RADDR_EX_CH2_S)
#define RMT_MEM_RADDR_EX_CH2_V  0x000003FFU
#define RMT_MEM_RADDR_EX_CH2_S  0
/** RMT_APB_MEM_WADDR_CH2 : RO; bitpos: [20:11]; default: 0;
 *  This register records the memory address offset when writes RAM over APB bus.
 */
#define RMT_APB_MEM_WADDR_CH2    0x000003FFU
#define RMT_APB_MEM_WADDR_CH2_M  (RMT_APB_MEM_WADDR_CH2_V << RMT_APB_MEM_WADDR_CH2_S)
#define RMT_APB_MEM_WADDR_CH2_V  0x000003FFU
#define RMT_APB_MEM_WADDR_CH2_S  11
/** RMT_STATE_CH2 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL2.
 */
#define RMT_STATE_CH2    0x00000007U
#define RMT_STATE_CH2_M  (RMT_STATE_CH2_V << RMT_STATE_CH2_S)
#define RMT_STATE_CH2_V  0x00000007U
#define RMT_STATE_CH2_S  22
/** RMT_MEM_EMPTY_CH2 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the data to be set is more than memory size and
 *  the wraparound mode is disabled.
 */
#define RMT_MEM_EMPTY_CH2    (BIT(25))
#define RMT_MEM_EMPTY_CH2_M  (RMT_MEM_EMPTY_CH2_V << RMT_MEM_EMPTY_CH2_S)
#define RMT_MEM_EMPTY_CH2_V  0x00000001U
#define RMT_MEM_EMPTY_CH2_S  25
/** RMT_APB_MEM_WR_ERR_CH2 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the offset address out of memory size when writes
 *  via APB bus.
 */
#define RMT_APB_MEM_WR_ERR_CH2    (BIT(26))
#define RMT_APB_MEM_WR_ERR_CH2_M  (RMT_APB_MEM_WR_ERR_CH2_V << RMT_APB_MEM_WR_ERR_CH2_S)
#define RMT_APB_MEM_WR_ERR_CH2_V  0x00000001U
#define RMT_APB_MEM_WR_ERR_CH2_S  26

/** RMT_CH3STATUS_REG register
 *  Channel 3 status register
 */
#define RMT_CH3STATUS_REG (DR_REG_RMT_BASE + 0x5c)
/** RMT_MEM_RADDR_EX_CH3 : RO; bitpos: [9:0]; default: 0;
 *  This register records the memory address offset when transmitter of CHANNEL3 is
 *  using the RAM.
 */
#define RMT_MEM_RADDR_EX_CH3    0x000003FFU
#define RMT_MEM_RADDR_EX_CH3_M  (RMT_MEM_RADDR_EX_CH3_V << RMT_MEM_RADDR_EX_CH3_S)
#define RMT_MEM_RADDR_EX_CH3_V  0x000003FFU
#define RMT_MEM_RADDR_EX_CH3_S  0
/** RMT_APB_MEM_WADDR_CH3 : RO; bitpos: [20:11]; default: 0;
 *  This register records the memory address offset when writes RAM over APB bus.
 */
#define RMT_APB_MEM_WADDR_CH3    0x000003FFU
#define RMT_APB_MEM_WADDR_CH3_M  (RMT_APB_MEM_WADDR_CH3_V << RMT_APB_MEM_WADDR_CH3_S)
#define RMT_APB_MEM_WADDR_CH3_V  0x000003FFU
#define RMT_APB_MEM_WADDR_CH3_S  11
/** RMT_STATE_CH3 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL3.
 */
#define RMT_STATE_CH3    0x00000007U
#define RMT_STATE_CH3_M  (RMT_STATE_CH3_V << RMT_STATE_CH3_S)
#define RMT_STATE_CH3_V  0x00000007U
#define RMT_STATE_CH3_S  22
/** RMT_MEM_EMPTY_CH3 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the data to be set is more than memory size and
 *  the wraparound mode is disabled.
 */
#define RMT_MEM_EMPTY_CH3    (BIT(25))
#define RMT_MEM_EMPTY_CH3_M  (RMT_MEM_EMPTY_CH3_V << RMT_MEM_EMPTY_CH3_S)
#define RMT_MEM_EMPTY_CH3_V  0x00000001U
#define RMT_MEM_EMPTY_CH3_S  25
/** RMT_APB_MEM_WR_ERR_CH3 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the offset address out of memory size when writes
 *  via APB bus.
 */
#define RMT_APB_MEM_WR_ERR_CH3    (BIT(26))
#define RMT_APB_MEM_WR_ERR_CH3_M  (RMT_APB_MEM_WR_ERR_CH3_V << RMT_APB_MEM_WR_ERR_CH3_S)
#define RMT_APB_MEM_WR_ERR_CH3_V  0x00000001U
#define RMT_APB_MEM_WR_ERR_CH3_S  26

/** RMT_CH4STATUS_REG register
 *  Channel 4 status register
 */
#define RMT_CH4STATUS_REG (DR_REG_RMT_BASE + 0x60)
/** RMT_MEM_WADDR_EX_CH4 : RO; bitpos: [9:0]; default: 192;
 *  This register records the memory address offset when receiver of CHANNEL4 is using
 *  the RAM.
 */
#define RMT_MEM_WADDR_EX_CH4    0x000003FFU
#define RMT_MEM_WADDR_EX_CH4_M  (RMT_MEM_WADDR_EX_CH4_V << RMT_MEM_WADDR_EX_CH4_S)
#define RMT_MEM_WADDR_EX_CH4_V  0x000003FFU
#define RMT_MEM_WADDR_EX_CH4_S  0
/** RMT_APB_MEM_RADDR_CH4 : RO; bitpos: [20:11]; default: 192;
 *  This register records the memory address offset when reads RAM over APB bus.
 */
#define RMT_APB_MEM_RADDR_CH4    0x000003FFU
#define RMT_APB_MEM_RADDR_CH4_M  (RMT_APB_MEM_RADDR_CH4_V << RMT_APB_MEM_RADDR_CH4_S)
#define RMT_APB_MEM_RADDR_CH4_V  0x000003FFU
#define RMT_APB_MEM_RADDR_CH4_S  11
/** RMT_STATE_CH4 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL4.
 */
#define RMT_STATE_CH4    0x00000007U
#define RMT_STATE_CH4_M  (RMT_STATE_CH4_V << RMT_STATE_CH4_S)
#define RMT_STATE_CH4_V  0x00000007U
#define RMT_STATE_CH4_S  22
/** RMT_MEM_OWNER_ERR_CH4 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the ownership of memory block is wrong.
 */
#define RMT_MEM_OWNER_ERR_CH4    (BIT(25))
#define RMT_MEM_OWNER_ERR_CH4_M  (RMT_MEM_OWNER_ERR_CH4_V << RMT_MEM_OWNER_ERR_CH4_S)
#define RMT_MEM_OWNER_ERR_CH4_V  0x00000001U
#define RMT_MEM_OWNER_ERR_CH4_S  25
/** RMT_MEM_FULL_CH4 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the receiver receives more data than the memory size.
 */
#define RMT_MEM_FULL_CH4    (BIT(26))
#define RMT_MEM_FULL_CH4_M  (RMT_MEM_FULL_CH4_V << RMT_MEM_FULL_CH4_S)
#define RMT_MEM_FULL_CH4_V  0x00000001U
#define RMT_MEM_FULL_CH4_S  26
/** RMT_APB_MEM_RD_ERR_CH4 : RO; bitpos: [27]; default: 0;
 *  This status bit will be set if the offset address out of memory size when reads via
 *  APB bus.
 */
#define RMT_APB_MEM_RD_ERR_CH4    (BIT(27))
#define RMT_APB_MEM_RD_ERR_CH4_M  (RMT_APB_MEM_RD_ERR_CH4_V << RMT_APB_MEM_RD_ERR_CH4_S)
#define RMT_APB_MEM_RD_ERR_CH4_V  0x00000001U
#define RMT_APB_MEM_RD_ERR_CH4_S  27

/** RMT_CH5STATUS_REG register
 *  Channel 5 status register
 */
#define RMT_CH5STATUS_REG (DR_REG_RMT_BASE + 0x64)
/** RMT_MEM_WADDR_EX_CH5 : RO; bitpos: [9:0]; default: 192;
 *  This register records the memory address offset when receiver of CHANNEL5 is using
 *  the RAM.
 */
#define RMT_MEM_WADDR_EX_CH5    0x000003FFU
#define RMT_MEM_WADDR_EX_CH5_M  (RMT_MEM_WADDR_EX_CH5_V << RMT_MEM_WADDR_EX_CH5_S)
#define RMT_MEM_WADDR_EX_CH5_V  0x000003FFU
#define RMT_MEM_WADDR_EX_CH5_S  0
/** RMT_APB_MEM_RADDR_CH5 : RO; bitpos: [20:11]; default: 192;
 *  This register records the memory address offset when reads RAM over APB bus.
 */
#define RMT_APB_MEM_RADDR_CH5    0x000003FFU
#define RMT_APB_MEM_RADDR_CH5_M  (RMT_APB_MEM_RADDR_CH5_V << RMT_APB_MEM_RADDR_CH5_S)
#define RMT_APB_MEM_RADDR_CH5_V  0x000003FFU
#define RMT_APB_MEM_RADDR_CH5_S  11
/** RMT_STATE_CH5 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL5.
 */
#define RMT_STATE_CH5    0x00000007U
#define RMT_STATE_CH5_M  (RMT_STATE_CH5_V << RMT_STATE_CH5_S)
#define RMT_STATE_CH5_V  0x00000007U
#define RMT_STATE_CH5_S  22
/** RMT_MEM_OWNER_ERR_CH5 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the ownership of memory block is wrong.
 */
#define RMT_MEM_OWNER_ERR_CH5    (BIT(25))
#define RMT_MEM_OWNER_ERR_CH5_M  (RMT_MEM_OWNER_ERR_CH5_V << RMT_MEM_OWNER_ERR_CH5_S)
#define RMT_MEM_OWNER_ERR_CH5_V  0x00000001U
#define RMT_MEM_OWNER_ERR_CH5_S  25
/** RMT_MEM_FULL_CH5 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the receiver receives more data than the memory size.
 */
#define RMT_MEM_FULL_CH5    (BIT(26))
#define RMT_MEM_FULL_CH5_M  (RMT_MEM_FULL_CH5_V << RMT_MEM_FULL_CH5_S)
#define RMT_MEM_FULL_CH5_V  0x00000001U
#define RMT_MEM_FULL_CH5_S  26
/** RMT_APB_MEM_RD_ERR_CH5 : RO; bitpos: [27]; default: 0;
 *  This status bit will be set if the offset address out of memory size when reads via
 *  APB bus.
 */
#define RMT_APB_MEM_RD_ERR_CH5    (BIT(27))
#define RMT_APB_MEM_RD_ERR_CH5_M  (RMT_APB_MEM_RD_ERR_CH5_V << RMT_APB_MEM_RD_ERR_CH5_S)
#define RMT_APB_MEM_RD_ERR_CH5_V  0x00000001U
#define RMT_APB_MEM_RD_ERR_CH5_S  27

/** RMT_CH6STATUS_REG register
 *  Channel 6 status register
 */
#define RMT_CH6STATUS_REG (DR_REG_RMT_BASE + 0x68)
/** RMT_MEM_WADDR_EX_CH6 : RO; bitpos: [9:0]; default: 192;
 *  This register records the memory address offset when receiver of CHANNEL6 is using
 *  the RAM.
 */
#define RMT_MEM_WADDR_EX_CH6    0x000003FFU
#define RMT_MEM_WADDR_EX_CH6_M  (RMT_MEM_WADDR_EX_CH6_V << RMT_MEM_WADDR_EX_CH6_S)
#define RMT_MEM_WADDR_EX_CH6_V  0x000003FFU
#define RMT_MEM_WADDR_EX_CH6_S  0
/** RMT_APB_MEM_RADDR_CH6 : RO; bitpos: [20:11]; default: 192;
 *  This register records the memory address offset when reads RAM over APB bus.
 */
#define RMT_APB_MEM_RADDR_CH6    0x000003FFU
#define RMT_APB_MEM_RADDR_CH6_M  (RMT_APB_MEM_RADDR_CH6_V << RMT_APB_MEM_RADDR_CH6_S)
#define RMT_APB_MEM_RADDR_CH6_V  0x000003FFU
#define RMT_APB_MEM_RADDR_CH6_S  11
/** RMT_STATE_CH6 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL6.
 */
#define RMT_STATE_CH6    0x00000007U
#define RMT_STATE_CH6_M  (RMT_STATE_CH6_V << RMT_STATE_CH6_S)
#define RMT_STATE_CH6_V  0x00000007U
#define RMT_STATE_CH6_S  22
/** RMT_MEM_OWNER_ERR_CH6 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the ownership of memory block is wrong.
 */
#define RMT_MEM_OWNER_ERR_CH6    (BIT(25))
#define RMT_MEM_OWNER_ERR_CH6_M  (RMT_MEM_OWNER_ERR_CH6_V << RMT_MEM_OWNER_ERR_CH6_S)
#define RMT_MEM_OWNER_ERR_CH6_V  0x00000001U
#define RMT_MEM_OWNER_ERR_CH6_S  25
/** RMT_MEM_FULL_CH6 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the receiver receives more data than the memory size.
 */
#define RMT_MEM_FULL_CH6    (BIT(26))
#define RMT_MEM_FULL_CH6_M  (RMT_MEM_FULL_CH6_V << RMT_MEM_FULL_CH6_S)
#define RMT_MEM_FULL_CH6_V  0x00000001U
#define RMT_MEM_FULL_CH6_S  26
/** RMT_APB_MEM_RD_ERR_CH6 : RO; bitpos: [27]; default: 0;
 *  This status bit will be set if the offset address out of memory size when reads via
 *  APB bus.
 */
#define RMT_APB_MEM_RD_ERR_CH6    (BIT(27))
#define RMT_APB_MEM_RD_ERR_CH6_M  (RMT_APB_MEM_RD_ERR_CH6_V << RMT_APB_MEM_RD_ERR_CH6_S)
#define RMT_APB_MEM_RD_ERR_CH6_V  0x00000001U
#define RMT_APB_MEM_RD_ERR_CH6_S  27

/** RMT_CH7STATUS_REG register
 *  Channel 7 status register
 */
#define RMT_CH7STATUS_REG (DR_REG_RMT_BASE + 0x6c)
/** RMT_MEM_WADDR_EX_CH7 : RO; bitpos: [9:0]; default: 192;
 *  This register records the memory address offset when receiver of CHANNEL7 is using
 *  the RAM.
 */
#define RMT_MEM_WADDR_EX_CH7    0x000003FFU
#define RMT_MEM_WADDR_EX_CH7_M  (RMT_MEM_WADDR_EX_CH7_V << RMT_MEM_WADDR_EX_CH7_S)
#define RMT_MEM_WADDR_EX_CH7_V  0x000003FFU
#define RMT_MEM_WADDR_EX_CH7_S  0
/** RMT_APB_MEM_RADDR_CH7 : RO; bitpos: [20:11]; default: 192;
 *  This register records the memory address offset when reads RAM over APB bus.
 */
#define RMT_APB_MEM_RADDR_CH7    0x000003FFU
#define RMT_APB_MEM_RADDR_CH7_M  (RMT_APB_MEM_RADDR_CH7_V << RMT_APB_MEM_RADDR_CH7_S)
#define RMT_APB_MEM_RADDR_CH7_V  0x000003FFU
#define RMT_APB_MEM_RADDR_CH7_S  11
/** RMT_STATE_CH7 : RO; bitpos: [24:22]; default: 0;
 *  This register records the FSM status of CHANNEL7.
 */
#define RMT_STATE_CH7    0x00000007U
#define RMT_STATE_CH7_M  (RMT_STATE_CH7_V << RMT_STATE_CH7_S)
#define RMT_STATE_CH7_V  0x00000007U
#define RMT_STATE_CH7_S  22
/** RMT_MEM_OWNER_ERR_CH7 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the ownership of memory block is wrong.
 */
#define RMT_MEM_OWNER_ERR_CH7    (BIT(25))
#define RMT_MEM_OWNER_ERR_CH7_M  (RMT_MEM_OWNER_ERR_CH7_V << RMT_MEM_OWNER_ERR_CH7_S)
#define RMT_MEM_OWNER_ERR_CH7_V  0x00000001U
#define RMT_MEM_OWNER_ERR_CH7_S  25
/** RMT_MEM_FULL_CH7 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the receiver receives more data than the memory size.
 */
#define RMT_MEM_FULL_CH7    (BIT(26))
#define RMT_MEM_FULL_CH7_M  (RMT_MEM_FULL_CH7_V << RMT_MEM_FULL_CH7_S)
#define RMT_MEM_FULL_CH7_V  0x00000001U
#define RMT_MEM_FULL_CH7_S  26
/** RMT_APB_MEM_RD_ERR_CH7 : RO; bitpos: [27]; default: 0;
 *  This status bit will be set if the offset address out of memory size when reads via
 *  APB bus.
 */
#define RMT_APB_MEM_RD_ERR_CH7    (BIT(27))
#define RMT_APB_MEM_RD_ERR_CH7_M  (RMT_APB_MEM_RD_ERR_CH7_V << RMT_APB_MEM_RD_ERR_CH7_S)
#define RMT_APB_MEM_RD_ERR_CH7_V  0x00000001U
#define RMT_APB_MEM_RD_ERR_CH7_S  27

