espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/rmt_reg.h
/** RMT_CH1CARRIER_DUTY_REG register
 *  Channel 1 duty cycle configuration register
 */
#define RMT_CH1CARRIER_DUTY_REG (DR_REG_RMT_BASE + 0x84)
/** RMT_CARRIER_LOW_CH1 : R/W; bitpos: [15:0]; default: 64;
 *  This register is used to configure carrier wave 's low level clock period for
 *  CHANNEL1.
 */
#define RMT_CARRIER_LOW_CH1    0x0000FFFFU
#define RMT_CARRIER_LOW_CH1_M  (RMT_CARRIER_LOW_CH1_V << RMT_CARRIER_LOW_CH1_S)
#define RMT_CARRIER_LOW_CH1_V  0x0000FFFFU
#define RMT_CARRIER_LOW_CH1_S  0
/** RMT_CARRIER_HIGH_CH1 : R/W; bitpos: [31:16]; default: 64;
 *  This register is used to configure carrier wave 's high level clock period for
 *  CHANNEL1.
 */
#define RMT_CARRIER_HIGH_CH1    0x0000FFFFU
#define RMT_CARRIER_HIGH_CH1_M  (RMT_CARRIER_HIGH_CH1_V << RMT_CARRIER_HIGH_CH1_S)
#define RMT_CARRIER_HIGH_CH1_V  0x0000FFFFU
#define RMT_CARRIER_HIGH_CH1_S  16

/** RMT_CH2CARRIER_DUTY_REG register
 *  Channel 2 duty cycle configuration register
 */
#define RMT_CH2CARRIER_DUTY_REG (DR_REG_RMT_BASE + 0x88)
/** RMT_CARRIER_LOW_CH2 : R/W; bitpos: [15:0]; default: 64;
 *  This register is used to configure carrier wave 's low level clock period for
 *  CHANNEL2.
 */
#define RMT_CARRIER_LOW_CH2    0x0000FFFFU
#define RMT_CARRIER_LOW_CH2_M  (RMT_CARRIER_LOW_CH2_V << RMT_CARRIER_LOW_CH2_S)
#define RMT_CARRIER_LOW_CH2_V  0x0000FFFFU
#define RMT_CARRIER_LOW_CH2_S  0
/** RMT_CARRIER_HIGH_CH2 : R/W; bitpos: [31:16]; default: 64;
 *  This register is used to configure carrier wave 's high level clock period for
 *  CHANNEL2.
 */
#define RMT_CARRIER_HIGH_CH2    0x0000FFFFU
#define RMT_CARRIER_HIGH_CH2_M  (RMT_CARRIER_HIGH_CH2_V << RMT_CARRIER_HIGH_CH2_S)
#define RMT_CARRIER_HIGH_CH2_V  0x0000FFFFU
#define RMT_CARRIER_HIGH_CH2_S  16

/** RMT_CH3CARRIER_DUTY_REG register
 *  Channel 3 duty cycle configuration register
 */
#define RMT_CH3CARRIER_DUTY_REG (DR_REG_RMT_BASE + 0x8c)
/** RMT_CARRIER_LOW_CH3 : R/W; bitpos: [15:0]; default: 64;
 *  This register is used to configure carrier wave 's low level clock period for
 *  CHANNEL3.
 */
#define RMT_CARRIER_LOW_CH3    0x0000FFFFU
#define RMT_CARRIER_LOW_CH3_M  (RMT_CARRIER_LOW_CH3_V << RMT_CARRIER_LOW_CH3_S)
#define RMT_CARRIER_LOW_CH3_V  0x0000FFFFU
#define RMT_CARRIER_LOW_CH3_S  0
/** RMT_CARRIER_HIGH_CH3 : R/W; bitpos: [31:16]; default: 64;
 *  This register is used to configure carrier wave 's high level clock period for
 *  CHANNEL3.
 */
#define RMT_CARRIER_HIGH_CH3    0x0000FFFFU
#define RMT_CARRIER_HIGH_CH3_M  (RMT_CARRIER_HIGH_CH3_V << RMT_CARRIER_HIGH_CH3_S)
#define RMT_CARRIER_HIGH_CH3_V  0x0000FFFFU
#define RMT_CARRIER_HIGH_CH3_S  16

/** RMT_CH4_RX_CARRIER_RM_REG register
 *  Channel 4 carrier remove register
 */
#define RMT_CH4_RX_CARRIER_RM_REG (DR_REG_RMT_BASE + 0x90)
/** RMT_CARRIER_LOW_THRES_CH4 : R/W; bitpos: [15:0]; default: 0;
 *  The low level period in a carrier modulation mode is
 *  (REG_RMT_REG_CARRIER_LOW_THRES_CH4 + 1) for channel 4.
 */
#define RMT_CARRIER_LOW_THRES_CH4    0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH4_M  (RMT_CARRIER_LOW_THRES_CH4_V << RMT_CARRIER_LOW_THRES_CH4_S)
#define RMT_CARRIER_LOW_THRES_CH4_V  0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH4_S  0
/** RMT_CARRIER_HIGH_THRES_CH4 : R/W; bitpos: [31:16]; default: 0;
 *  The high level period in a carrier modulation mode is
 *  (REG_RMT_REG_CARRIER_HIGH_THRES_CH4 + 1) for channel 4.
 */
#define RMT_CARRIER_HIGH_THRES_CH4    0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH4_M  (RMT_CARRIER_HIGH_THRES_CH4_V << RMT_CARRIER_HIGH_THRES_CH4_S)
#define RMT_CARRIER_HIGH_THRES_CH4_V  0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH4_S  16

/** RMT_CH5_RX_CARRIER_RM_REG register
 *  Channel 5 carrier remove register
 */
#define RMT_CH5_RX_CARRIER_RM_REG (DR_REG_RMT_BASE + 0x94)
/** RMT_CARRIER_LOW_THRES_CH5 : R/W; bitpos: [15:0]; default: 0;
 *  The low level period in a carrier modulation mode is
 *  (REG_RMT_REG_CARRIER_LOW_THRES_CH5 + 1) for channel 5.
 */
#define RMT_CARRIER_LOW_THRES_CH5    0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH5_M  (RMT_CARRIER_LOW_THRES_CH5_V << RMT_CARRIER_LOW_THRES_CH5_S)
#define RMT_CARRIER_LOW_THRES_CH5_V  0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH5_S  0
/** RMT_CARRIER_HIGH_THRES_CH5 : R/W; bitpos: [31:16]; default: 0;
 *  The high level period in a carrier modulation mode is
 *  (REG_RMT_REG_CARRIER_HIGH_THRES_CH5 + 1) for channel 5.
 */
#define RMT_CARRIER_HIGH_THRES_CH5    0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH5_M  (RMT_CARRIER_HIGH_THRES_CH5_V << RMT_CARRIER_HIGH_THRES_CH5_S)
#define RMT_CARRIER_HIGH_THRES_CH5_V  0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH5_S  16

/** RMT_CH6_RX_CARRIER_RM_REG register
 *  Channel 6 carrier remove register
 */
#define RMT_CH6_RX_CARRIER_RM_REG (DR_REG_RMT_BASE + 0x98)
/** RMT_CARRIER_LOW_THRES_CH6 : R/W; bitpos: [15:0]; default: 0;
 *  The low level period in a carrier modulation mode is
 *  (REG_RMT_REG_CARRIER_LOW_THRES_CH6 + 1) for channel 6.
 */
#define RMT_CARRIER_LOW_THRES_CH6    0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH6_M  (RMT_CARRIER_LOW_THRES_CH6_V << RMT_CARRIER_LOW_THRES_CH6_S)
#define RMT_CARRIER_LOW_THRES_CH6_V  0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH6_S  0
/** RMT_CARRIER_HIGH_THRES_CH6 : R/W; bitpos: [31:16]; default: 0;
 *  The high level period in a carrier modulation mode is
 *  (REG_RMT_REG_CARRIER_HIGH_THRES_CH6 + 1) for channel 6.
 */
#define RMT_CARRIER_HIGH_THRES_CH6    0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH6_M  (RMT_CARRIER_HIGH_THRES_CH6_V << RMT_CARRIER_HIGH_THRES_CH6_S)
#define RMT_CARRIER_HIGH_THRES_CH6_V  0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH6_S  16

/** RMT_CH7_RX_CARRIER_RM_REG register
 *  Channel 7 carrier remove register
 */
#define RMT_CH7_RX_CARRIER_RM_REG (DR_REG_RMT_BASE + 0x9c)
/** RMT_CARRIER_LOW_THRES_CH7 : R/W; bitpos: [15:0]; default: 0;
 *  The low level period in a carrier modulation mode is
 *  (REG_RMT_REG_CARRIER_LOW_THRES_CH7 + 1) for channel 7.
 */
#define RMT_CARRIER_LOW_THRES_CH7    0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH7_M  (RMT_CARRIER_LOW_THRES_CH7_V << RMT_CARRIER_LOW_THRES_CH7_S)
#define RMT_CARRIER_LOW_THRES_CH7_V  0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH7_S  0
/** RMT_CARRIER_HIGH_THRES_CH7 : R/W; bitpos: [31:16]; default: 0;
 *  The high level period in a carrier modulation mode is
 *  (REG_RMT_REG_CARRIER_HIGH_THRES_CH7 + 1) for channel 7.
 */
#define RMT_CARRIER_HIGH_THRES_CH7    0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH7_M  (RMT_CARRIER_HIGH_THRES_CH7_V << RMT_CARRIER_HIGH_THRES_CH7_S)
#define RMT_CARRIER_HIGH_THRES_CH7_V  0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH7_S  16

