espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/rmt_reg.h
/** RMT_CH4_RX_LIM_REG register
 *  Channel 4 Rx event configuration register
 */
#define RMT_CH4_RX_LIM_REG (DR_REG_RMT_BASE + 0xb0)
/** RMT_CH4_RX_LIM : R/W; bitpos: [8:0]; default: 128;
 *  This register is used to configure the maximum entries that CHANNEL4 can receive.
 */
#define RMT_CH4_RX_LIM    0x000001FFU
#define RMT_CH4_RX_LIM_M  (RMT_CH4_RX_LIM_V << RMT_CH4_RX_LIM_S)
#define RMT_CH4_RX_LIM_V  0x000001FFU
#define RMT_CH4_RX_LIM_S  0

/** RMT_CH5_RX_LIM_REG register
 *  Channel 5 Rx event configuration register
 */
#define RMT_CH5_RX_LIM_REG (DR_REG_RMT_BASE + 0xb4)
/** RMT_CH5_RX_LIM : R/W; bitpos: [8:0]; default: 128;
 *  This register is used to configure the maximum entries that CHANNEL5 can receive.
 */
#define RMT_CH5_RX_LIM    0x000001FFU
#define RMT_CH5_RX_LIM_M  (RMT_CH5_RX_LIM_V << RMT_CH5_RX_LIM_S)
#define RMT_CH5_RX_LIM_V  0x000001FFU
#define RMT_CH5_RX_LIM_S  0

/** RMT_CH6_RX_LIM_REG register
 *  Channel 6 Rx event configuration register
 */
#define RMT_CH6_RX_LIM_REG (DR_REG_RMT_BASE + 0xb8)
/** RMT_CH6_RX_LIM : R/W; bitpos: [8:0]; default: 128;
 *  This register is used to configure the maximum entries that CHANNEL6 can receive.
 */
#define RMT_CH6_RX_LIM    0x000001FFU
#define RMT_CH6_RX_LIM_M  (RMT_CH6_RX_LIM_V << RMT_CH6_RX_LIM_S)
#define RMT_CH6_RX_LIM_V  0x000001FFU
#define RMT_CH6_RX_LIM_S  0

/** RMT_CH7_RX_LIM_REG register
 *  Channel 7 Rx event configuration register
 */
#define RMT_CH7_RX_LIM_REG (DR_REG_RMT_BASE + 0xbc)
/** RMT_CH7_RX_LIM : R/W; bitpos: [8:0]; default: 128;
 *  This register is used to configure the maximum entries that CHANNEL7 can receive.
 */
#define RMT_CH7_RX_LIM    0x000001FFU
#define RMT_CH7_RX_LIM_M  (RMT_CH7_RX_LIM_V << RMT_CH7_RX_LIM_S)
#define RMT_CH7_RX_LIM_V  0x000001FFU
#define RMT_CH7_RX_LIM_S  0

/** RMT_SYS_CONF_REG register
 *  RMT apb configuration register
 */
#define RMT_SYS_CONF_REG (DR_REG_RMT_BASE + 0xc0)
/** RMT_APB_FIFO_MASK : R/W; bitpos: [0]; default: 0;
 *  1'h1: access memory directly.   1'h0: access memory by FIFO.
 */
#define RMT_APB_FIFO_MASK    (BIT(0))
#define RMT_APB_FIFO_MASK_M  (RMT_APB_FIFO_MASK_V << RMT_APB_FIFO_MASK_S)
#define RMT_APB_FIFO_MASK_V  0x00000001U
#define RMT_APB_FIFO_MASK_S  0
/** RMT_MEM_CLK_FORCE_ON : R/W; bitpos: [1]; default: 0;
 *  Set this bit to enable the clock for RMT memory.
 */
#define RMT_MEM_CLK_FORCE_ON    (BIT(1))
#define RMT_MEM_CLK_FORCE_ON_M  (RMT_MEM_CLK_FORCE_ON_V << RMT_MEM_CLK_FORCE_ON_S)
#define RMT_MEM_CLK_FORCE_ON_V  0x00000001U
#define RMT_MEM_CLK_FORCE_ON_S  1
/** RMT_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down RMT memory.
 */
#define RMT_MEM_FORCE_PD    (BIT(2))
#define RMT_MEM_FORCE_PD_M  (RMT_MEM_FORCE_PD_V << RMT_MEM_FORCE_PD_S)
#define RMT_MEM_FORCE_PD_V  0x00000001U
#define RMT_MEM_FORCE_PD_S  2
/** RMT_MEM_FORCE_PU : R/W; bitpos: [3]; default: 0;
 *  1: Disable RMT memory light sleep power down function. 0: Power down RMT memory
 *  when RMT is in light sleep mode.
 */
#define RMT_MEM_FORCE_PU    (BIT(3))
#define RMT_MEM_FORCE_PU_M  (RMT_MEM_FORCE_PU_V << RMT_MEM_FORCE_PU_S)
#define RMT_MEM_FORCE_PU_V  0x00000001U
#define RMT_MEM_FORCE_PU_S  3
/** RMT_SCLK_DIV_NUM : R/W; bitpos: [11:4]; default: 1;
 *  the integral part of the fractional divisor
 */
#define RMT_SCLK_DIV_NUM    0x000000FFU
#define RMT_SCLK_DIV_NUM_M  (RMT_SCLK_DIV_NUM_V << RMT_SCLK_DIV_NUM_S)
#define RMT_SCLK_DIV_NUM_V  0x000000FFU
#define RMT_SCLK_DIV_NUM_S  4
/** RMT_SCLK_DIV_A : R/W; bitpos: [17:12]; default: 0;
 *  the numerator of the fractional part of the fractional divisor
 */
#define RMT_SCLK_DIV_A    0x0000003FU
#define RMT_SCLK_DIV_A_M  (RMT_SCLK_DIV_A_V << RMT_SCLK_DIV_A_S)
#define RMT_SCLK_DIV_A_V  0x0000003FU
#define RMT_SCLK_DIV_A_S  12
/** RMT_SCLK_DIV_B : R/W; bitpos: [23:18]; default: 0;
 *  the denominator of the fractional part of the fractional divisor
 */
#define RMT_SCLK_DIV_B    0x0000003FU
#define RMT_SCLK_DIV_B_M  (RMT_SCLK_DIV_B_V << RMT_SCLK_DIV_B_S)
#define RMT_SCLK_DIV_B_V  0x0000003FU
#define RMT_SCLK_DIV_B_S  18
/** RMT_SCLK_SEL : R/W; bitpos: [25:24]; default: 1;
 *  choose the clock source of rmt_sclk. 1:CLK_80Mhz.2:CLK_8MHz.3:XTAL
 */
#define RMT_SCLK_SEL    0x00000003U
#define RMT_SCLK_SEL_M  (RMT_SCLK_SEL_V << RMT_SCLK_SEL_S)
#define RMT_SCLK_SEL_V  0x00000003U
#define RMT_SCLK_SEL_S  24
/** RMT_SCLK_ACTIVE : R/W; bitpos: [26]; default: 1;
 *  rmt_sclk switch
 */
#define RMT_SCLK_ACTIVE    (BIT(26))
#define RMT_SCLK_ACTIVE_M  (RMT_SCLK_ACTIVE_V << RMT_SCLK_ACTIVE_S)
#define RMT_SCLK_ACTIVE_V  0x00000001U
#define RMT_SCLK_ACTIVE_S  26
/** RMT_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  RMT register clock gate enable signal. 1: Power up the drive clock of registers. 0:
 *  Power down the drive clock of registers
 */
#define RMT_CLK_EN    (BIT(31))
#define RMT_CLK_EN_M  (RMT_CLK_EN_V << RMT_CLK_EN_S)
#define RMT_CLK_EN_V  0x00000001U
#define RMT_CLK_EN_S  31

/** RMT_TX_SIM_REG register
 *  RMT TX synchronous register
 */
#define RMT_TX_SIM_REG (DR_REG_RMT_BASE + 0xc4)
/** RMT_TX_SIM_CH0 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable CHANNEL0 to start sending data synchronously with other
 *  enabled channels.
 */
#define RMT_TX_SIM_CH0    (BIT(0))
#define RMT_TX_SIM_CH0_M  (RMT_TX_SIM_CH0_V << RMT_TX_SIM_CH0_S)
#define RMT_TX_SIM_CH0_V  0x00000001U
#define RMT_TX_SIM_CH0_S  0
/** RMT_TX_SIM_CH1 : R/W; bitpos: [1]; default: 0;
 *  Set this bit to enable CHANNEL1 to start sending data synchronously with other
 *  enabled channels.
 */
#define RMT_TX_SIM_CH1    (BIT(1))
#define RMT_TX_SIM_CH1_M  (RMT_TX_SIM_CH1_V << RMT_TX_SIM_CH1_S)
#define RMT_TX_SIM_CH1_V  0x00000001U
#define RMT_TX_SIM_CH1_S  1
/** RMT_TX_SIM_CH2 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to enable CHANNEL2 to start sending data synchronously with other
 *  enabled channels.
 */
#define RMT_TX_SIM_CH2    (BIT(2))
#define RMT_TX_SIM_CH2_M  (RMT_TX_SIM_CH2_V << RMT_TX_SIM_CH2_S)
#define RMT_TX_SIM_CH2_V  0x00000001U
#define RMT_TX_SIM_CH2_S  2
/** RMT_TX_SIM_CH3 : R/W; bitpos: [3]; default: 0;
 *  Set this bit to enable CHANNEL3 to start sending data synchronously with other
 *  enabled channels.
 */
#define RMT_TX_SIM_CH3    (BIT(3))
#define RMT_TX_SIM_CH3_M  (RMT_TX_SIM_CH3_V << RMT_TX_SIM_CH3_S)
#define RMT_TX_SIM_CH3_V  0x00000001U
#define RMT_TX_SIM_CH3_S  3
/** RMT_TX_SIM_EN : R/W; bitpos: [4]; default: 0;
 *  This register is used to enable multiple of channels to start sending data
 *  synchronously.
 */
#define RMT_TX_SIM_EN    (BIT(4))
#define RMT_TX_SIM_EN_M  (RMT_TX_SIM_EN_V << RMT_TX_SIM_EN_S)
#define RMT_TX_SIM_EN_V  0x00000001U
#define RMT_TX_SIM_EN_S  4

